Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Due to rounding errors, it is very unlikely that two floating-point values will match exactly, so EXPECT_EQ is not suitable.
it_it: A causa degli errori di arrotondamento, è molto improbabile che due valori in virgola mobile corrispondano esattamente, quindi EXPECT_EQ non è adatta.

source: Due to rounding errors, it is very unlikely that two floating-point values will match exactly, so `EXPECT_EQ` is not suitable.
it_it: A causa degli errori di arrotondamento, è molto improbabile che due valori in virgola mobile corrispondano esattamente, quindi `EXPECT_EQ` non è adatta.

source: Due to some peculiarity of C++, it requires some non-trivial template meta programming tricks to support using NULL as an argument of the EXPECT_XX() and ASSERT_XX() macros.
it_it: A causa di alcune peculiarità del C++, sono necessari alcuni trucchi di metaprogrammazione non banali per supportare l'uso di NULL come argomento delle macro EXPECT_XX() e ASSERT_XX().

source: Due to some peculiarity of C++, it requires some non-trivial template meta programming tricks to support using `NULL` as an argument of the `EXPECT_XX()` and `ASSERT_XX()` macros.
it_it: A causa di alcune peculiarità del C++, sono necessari alcuni trucchi di metaprogrammazione non banali per supportare l'uso di `NULL` come argomento delle macro `EXPECT_XX()` e `ASSERT_XX()`.

source: Dynamically registers a test with the framework.
it_it: Registra dinamicamente un test con il framework.

source: E* Dequeue(); // Returns NULL if the queue is empty.
it_it: E* Dequeue(); // Restituisce NULL se la coda è vuota.

source: E.g. Contains(Key(Le(5))) can verify that a map contains a key <= 5.
it_it: Perr esempio Contains(Key(Le(5))) può verificare che una map contenga una chiave <= 5.

source: E.g. SizeIs(2) or SizeIs(Lt(2)).
it_it: Per esempio SizeIs(2) o SizeIs(Lt(2)).

source: E.g. WhenSorted(ElementsAre(1, 2, 3)) verifies that argument contains elements 1, 2, and 3, ignoring order.
it_it: Per esempio WhenSorted(ElementsAre(1, 2, 3)) verifica che argument contenga gli elementi 1, 2 e 3, ignorando l'ordine.

source: E.g. WhenSortedBy(std::greater(), ElementsAre(3, 2, 1)).
it_it: Per esempio WhenSortedBy(std::greater(), ElementsAre(3, 2, 1)).

source: E.g. BeginEndDistanceIs(2) or BeginEndDistanceIs(Lt(2)).
it_it: Per esempio BeginEndDistanceIs(2) o BeginEndDistanceIs(Lt(2)).

source: E.g. Pointwise(Le(), upper_bounds) verifies that each element in argument doesn't exceed the corresponding element in upper_bounds.
it_it: Per esempio Pointwise(Le(), upper_bounds) verifica che ciascun elemento in argument non superi l'elemento corrispondente in upper_bounds.

source: E.g. `BeginEndDistanceIs(2)` or `BeginEndDistanceIs(Lt(2))`.
it_it: Per esempio `BeginEndDistanceIs(2)` o `BeginEndDistanceIs(Lt(2))`.

source: E.g. `Contains(Key(Le(5)))` can verify that a `map` contains a key `<= 5`.
it_it: Per esempio `Contains(Key(Le(5)))` può verificare che una `map` contenga una chiave `<= 5`.

source: E.g. `Pointwise(Le(), upper_bounds)` verifies that each element in `argument` doesn't exceed the corresponding element in `upper_bounds`.
it_it: Per esempio `Pointwise(Le(), upper_bounds)` verifica che ciascun elemento in `argument` non superi l'elemento corrispondente in `upper_bounds`.

source: E.g. `SizeIs(2)` or `SizeIs(Lt(2))`.
it_it: Per esempio `SizeIs(2)` o `SizeIs(Lt(2))`.

source: E.g. `WhenSorted(ElementsAre(1, 2, 3))` verifies that `argument` contains elements 1, 2, and 3, ignoring order.
it_it: Per esempio `WhenSorted(ElementsAre(1, 2, 3))` verifica che `argument` contenga gli elementi 1, 2 e 3, ignorando l'ordine.

source: E.g. `WhenSortedBy(std::greater(), ElementsAre(3, 2, 1))`.
it_it: Per esempio `WhenSortedBy(std::greater(), ElementsAre(3, 2, 1))`.

source: EXPECT_CALL(Const(foo), GetBar()) // The const GetBar().
it_it: EXPECT_CALL(Const(foo), GetBar()) // Il GetBar() const.

source: EXPECT_CALL(foo, Bar(NotNull())); // The argument must be a non-NULL pointer.
it_it: EXPECT_CALL(foo, Bar(NotNull())); // L'argomento deve essere un puntatore non NULL.

source: EXPECT_CALL(foo, GetBar()) // The non-const GetBar().
it_it: EXPECT_CALL(foo, GetBar()) // Il GetBar() non-const.

source: EXPECT_CALL(turtle, Forward); // Expects the turtle to jump somewhere.
it_it: EXPECT_CALL(turtle, Forward); // Si aspetta che la tartaruga salti da qualche parte.

source: EXPECT_EQ(Factorial(0), 1); } // Tests factorial of positive numbers.
it_it: EXPECT_EQ(Factorial(0), 1); } // Testa il fattoriale di numeri positivi.

source: EXPECT_EQ(f.Bar(input_filepath, output_filepath), 0); } // Tests that Foo does Xyz.
it_it: EXPECT_EQ(f.Bar(input_filepath, output_filepath), 0); } // Verifica che Foo esegua Xyz.

source: EXPECT_EQ(htonl(blah), blah_blah) generates weird compiler errors in opt mode.
it_it: EXPECT_EQ(htonl(blah), blah_blah) genera strani errori del compilatore in modalità opt.

source: EXPECT_PRED1(IsNegative<int>, -5); // Must specify type for IsNegative
it_it: EXPECT_PRED1(IsNegative<int>, -5); // È necessario specificare il tipo per IsNegative

source: EXPECT_PRED2(MutuallyPrime, a, b); // Succeeds EXPECT_PRED2(MutuallyPrime, b, c); // Fails
it_it: EXPECT_PRED2(MutuallyPrime, a, b); // Successo EXPECT_PRED2(MutuallyPrime, b, c); // Fallisce

source: EXPECT_PRED_FORMAT2(AssertMutuallyPrime, a, b); // Succeeds EXPECT_PRED_FORMAT2(AssertMutuallyPrime, b, c); // Fails
it_it: EXPECT_PRED_FORMAT2(AssertMutuallyPrime, a, b); // Successo EXPECT_PRED_FORMAT2(AssertMutuallyPrime, b, c); // Fallisce

source: Each <failure> element corresponds to a single failed GoogleTest assertion.
it_it: Ogni elemento <failure> corrisponde a una singola asserzione GoogleTest non riuscita.

source: Each `<failure>` element corresponds to a single failed GoogleTest assertion.
it_it: Ogni elemento `<failure>` corrisponde a una singola asserzione GoogleTest non riuscita.

source: Each call will return the next ai in the list, starting at the beginning when the end of the list is reached.
it_it: Ogni chiamata restituirà il successivo ai nell'elenco, iniziando dall'inizio quando viene raggiunta la fine dell'elenco.

source: Each call will return the next `ai` in the list, starting at the beginning when the end of the list is reached.
it_it: Ogni chiamata restituirà il successivo `ai` nell'elenco, iniziando dall'inizio quando viene raggiunta la fine dell'elenco.

source: Each matching function call will perform the next action in the order declared.
it_it: Ogni chiamata di funzione corrispondente [match] eseguirà la action successiva nell'ordine dichiarato.

source: Each test fixture has a corresponding and same named test suite.
it_it: Ogni fixture ha una test suite corrispondente e con lo stesso nome.

source: Each workspace directory has a text file named WORKSPACE which may be empty, or may contain references to external dependencies required to build the outputs.
it_it: Ciascuna directory del workspace ha un file di testo chiamato WORKSPACE che può essere vuoto o contenere riferimenti a dipendenze esterne necessarie per buildare gli output.

source: Each workspace directory has a text file named `WORKSPACE` which may be empty, or may contain references to external dependencies required to build the outputs.
it_it: Ciascuna directory del workspace ha un file di testo chiamato `WORKSPACE` che può essere vuoto o contenere riferimenti a dipendenze esterne necessarie per buildare gli output.

source: Eg ref(&) or ref(&&).
it_it: Ad esempio ref(&) o ref(&&).

source: Eg `ref(&)` or `ref(&&)`.
it_it: Ad esempio `ref(&)` o `ref(&&)`.

source: Either form of the macro can be followed by some optional *clauses* that provide more information about the expectation.
it_it: Entrambe le forme della macro possono essere seguite da alcune *clausole* [clause] facoltative che forniscono ulteriori informazioni sulla expectation.

source: Either form of the macro can be followed by some optional clauses that provide more information about the expectation.
it_it: Entrambe le forme della macro possono essere seguite da alcune clausole [clause] facoltative che forniscono ulteriori informazioni sulla expectation.

source: Either way is fine - you want to choose the one that's more convenient for your circumstance.
it_it: Va bene in ogni caso: si scelga quello più conveniente per le proprie circostanze.

source: Ellipsis arguments are inherited from C and not really a C++ feature.
it_it: Gli argomenti con i puntini di sospensione sono ereditati dal C e non sono realmente una funzionalità del C++.

source: Equivalent to m.
it_it: Equivalente a m.

source: Equivalent to `m`.
it_it: Equivalente a `m`.

source: Error message from ASSERT_NEAR
it_it: Messaggio di errore da ASSERT_NEAR

source: Even though GoogleTest has a rich set of assertions, they can never be complete, as it's impossible (nor a good idea) to anticipate all scenarios a user might run into.
it_it: Anche se GoogleTest dispone di un ricco insieme di asserzioni, queste non potranno mai essere complete, poiché è impossibile (e non è nemmeno una buona idea) prevedere tutti gli scenari in cui un utente potrebbe imbattersi.

source: Event listener example
it_it: Esempio di listener di eventi

source: Every EXPECT_CALL adds a constraint on the behavior of the code under test.
it_it: Ogni EXPECT_CALL aggiunge un vincolo sul comportamento del codice sotto test.

source: Every `EXPECT_CALL` adds a constraint on the behavior of the code under test.
it_it: Ogni `EXPECT_CALL` aggiunge un vincolo sul comportamento del codice sotto test.

source: Every time this EXPECT_CALL fires, a new unique_ptr<Buzz> will be created and returned.
it_it: Ogni volta che questa EXPECT_CALL si attiva, verrà creato e restituito un nuovo unique_ptr<Buzz>.

source: Every time this `EXPECT_CALL` fires, a new `unique_ptr<Buzz>` will be created and returned.
it_it: Ogni volta che questa `EXPECT_CALL` si attiva, verrà creato e restituito un nuovo `unique_ptr<Buzz>`.

source: Example usage:
it_it: Esempio d'uso:

source: Example:
it_it: Esempio:

source: Examples:
it_it: Esempi:

source: Except Ref(), these matchers make a copy of value in case it's modified or destructed later.
it_it: Ad eccezione di Ref(), questi matcher creano una copia di value nel caso in cui venga modificato o distrutto in seguito.

source: Except `Ref()`, these matchers make a *copy* of `value` in case it's modified or destructed later.
it_it: Ad eccezione di `Ref()`, questi matcher creano una *copia* di `value` nel caso in cui venga modificato o distrutto in seguito.

source: Exception Assertions
it_it: Asserzioni di Eccezioni

source: Exception Assertions {#exceptions}
it_it: Asserzioni di Eccezioni {#exceptions}

source: Exception which can be thrown from TestEventListener::OnTestPartResult.
it_it: Eccezione che può essere generata da TestEventListener::OnTestPartResult.

source: Exception which can be thrown from [`TestEventListener::OnTestPartResult`](#TestEventListener::OnTestPartResult).
it_it: Eccezione che può essere generata da [`TestEventListener::OnTestPartResult`](#TestEventListener::OnTestPartResult).

source: Execute your *test code* (as opposed to the code being tested) in *one* thread.
it_it: Si esegue il *codice di test* (in contrapposizione al codice da testare) in *un solo* thread.

source: Execute your test code (as opposed to the code being tested) in one thread.
it_it: Si esegue il codice di test (in contrapposizione al codice da testare) in un solo thread.

source: Exercise a particular program path with specific input values and verify the results
it_it: Testare un particolare path del programma con valori di input specifici e verificare i risultati

source: Exercise code that uses std::function.
it_it: Codice di esercizio che usa std::function.

source: Exercise code that uses the mock objects; if necessary, check the result using googletest assertions.
it_it: Codice di esercizio che utilizza gli oggetti mock; se necessario, si controlla il risultato utilizzando le asserzioni di googletest.

source: Exercise some code that uses the mocks; optionally, check the result using googletest assertions.
it_it: Si esegue il codice che utilizza i mock; facoltativamente, si controlla il risultato utilizzando le asserzioni di googletest.

source: Expanding what we learned above to *polymorphic* matchers is now just as simple as adding templates in the right place.
it_it: Estendere ciò che abbiamo appreso sopra riguardo i matcher *polimorfici* risulta ora semplice come aggiungere i template nel posto giusto.

source: Expanding what we learned above to polymorphic matchers is now just as simple as adding templates in the right place.
it_it: Estendere ciò che abbiamo appreso sopra riguardo i matcher polimorfici risulta ora semplice come aggiungere i template nel posto giusto.

source: Expectation Order
it_it: Ordine delle Expectation

source: ExpectationSet all_inits; // Collect all expectations of InitElement() calls for (int i = 0; i < element_count; i++) {
it_it: ExpectationSet all_inits; // Racchiude tutte le expectation delle chiamate a InitElement() for (int i = 0; i < element_count; i++) {

source: Expectations in the same sequence must occur in the order they are written.
it_it: Le expectation nella stessa sequenza devono verificarsi nell'ordine in cui sono scritte.

source: Expected calls assigned to the same sequence are expected to occur in the order the expectations are declared.
it_it: Le chiamate previste assegnate alla stessa sequenza ci si aspetta che avvengano nell'ordine in cui vengono dichiarate le expectation.

source: Expecting Ordered Calls {#OrderedCalls}
it_it: Expect di Chiamate Ordinate {#OrderedCalls}

source: Expecting Partially Ordered Calls {#PartialOrder}
it_it: Expecting Chiamate Parzialmente Ordinate {#PartialOrder}

source: Explicit Success and Failure
it_it: Successi e Fallimento Espliciti

source: Explicit Success and Failure {#success-failure}
it_it: Successo e Fallimento Espliciti {#success-failure}

source: Expression
it_it: Espressione

source: Extending GoogleTest by Handling Test Events
it_it: Estendere GoogleTest Gestendo gli Eventi dei Test

source: Extending gMock
it_it: Estendere gMock

source: Failure-raising listener example
it_it: Esempio di listener che genera errori

source: FakeFoo fake_; // Keeps an instance of the fake in the mock.
it_it: FakeFoo fake_; // Mantiene un'istanza del fake nel mock.

source: Fakes and mocks actually mean very different things in the Test-Driven Development (TDD) community:
it_it: I fake e i mock in realtà significano cose molto diverse nella comunità del Test-Driven Development (TDD):

source: Fatal assertion
it_it: Asserzione fatale

source: Finally Field() and Property() provide overloads that take the field or property names as the first argument to include it in the error message.
it_it: Infine Field() e Property() forniscono gli overload che accettano i nomi del campo o della proprietà come primo argomento per includerlo nel messaggio di errore.

source: Finally `Field()` and `Property()` provide overloads that take the field or property names as the first argument to include it in the error message.
it_it: Infine `Field()` e `Property()` forniscono gli overload che accettano i nomi del campo o della proprietà come primo argomento per includerlo nel messaggio di errore.

source: Finally, GetX() and GetY() tell you the current position of the turtle.
it_it: Infine, GetX() e GetY() dicono la posizione attuale della tartaruga.

source: Finally, `GetX()` and `GetY()` tell you the current position of the turtle.
it_it: Infine, `GetX()` e `GetY()` dicono la posizione attuale della tartaruga.

source: Finally, with the growth of the gMock matcher library, we are encouraging people to use the unified EXPECT_THAT(value, matcher) syntax more often in tests.
it_it: Infine, con la crescita della libreria di matcher gMock, stiamo incoraggiando le persone a utilizzare la sintassi unificata EXPECT_THAT(value, matcher) più spesso nei test.

source: Finally, with the growth of the gMock matcher library, we are encouraging people to use the unified `EXPECT_THAT(value, matcher)` syntax more often in tests.
it_it: Infine, con la crescita della libreria di matcher gMock, stiamo incoraggiando le persone a utilizzare la sintassi unificata `EXPECT_THAT(value, matcher)` più spesso nei test.

source: Finally, you are free to instantiate the pattern with the types you want.
it_it: Infine, si può istanziare il pattern con i tipi desiderati.

source: Finally, you can use the INSTANTIATE_TEST_SUITE_P macro to instantiate the test suite with any set of parameters you want.
it_it: Infine, si può utilizzare la macro INSTANTIATE_TEST_SUITE_P per istanziare la test suite con qualsiasi set di parametri desiderato.

source: Finally, you can use the `INSTANTIATE_TEST_SUITE_P` macro to instantiate the test suite with any set of parameters you want.
it_it: Infine, si può utilizzare la macro `INSTANTIATE_TEST_SUITE_P` per istanziare la test suite con qualsiasi set di parametri desiderato.

source: Finally, you should be **very cautious** about when to use naggy or strict mocks, as they tend to make tests more brittle and harder to maintain.
it_it: Infine, si deve porre **molta attenzione** su quando utilizzare mock "naggy" o "strict", poiché tendono a rendere i test più fragili e più difficili da mantenere.

source: Finally, you should be very cautious about when to use naggy or strict mocks, as they tend to make tests more brittle and harder to maintain.
it_it: Infine, si deve porre molta attenzione su quando utilizzare mock "naggy" o "strict", poiché tendono a rendere i test più fragili e più difficili da mantenere.

source: Fired after a failed assertion or a SUCCEED() invocation.
it_it: Attivato dopo un'asserzione non riuscita o un'invocazione SUCCEED().

source: Fired after a failed assertion or a `SUCCEED()` invocation.
it_it: Attivato dopo un'asserzione non riuscita o un'invocazione `SUCCEED()`.

source: Fired after all test activities have ended.
it_it: Attivato al termine di tutte le attività di test.

source: Fired after each iteration of tests finishes.
it_it: Attivato al termine di ogni iterazione dei test.

source: Fired after environment set-up for each iteration of tests ends.
it_it: Attivato al termine della configurazione dell'ambiente per ogni iterazione dei test.

source: Fired after environment tear-down for each iteration of tests ends.
it_it: Attivato al termine del tear-down dell'ambiente per ogni iterazione dei test.

source: Fired after the test ends.
it_it: Attivato al termine del test.

source: Fired after the test suite ends.
it_it: Attivato al termine della test suite.

source: Fired before any test activity starts.
it_it: Attivato prima dell'inizio di qualsiasi attività di test.

source: Fired before each iteration of tests starts.
it_it: Attivato prima dell'inizio di ogni iterazione dei test.

source: Fired before environment set-up for each iteration of tests starts.
it_it: Attivato prima dell'avvio della configurazione dell'ambiente per ogni iterazione dei test.

source: Fired before environment tear-down for each iteration of tests starts.
it_it: Attivato prima dell'avvio del tear-down dell'ambiente per ogni iterazione dei test.

source: Fired before the test starts.
it_it: Attivato prima dell'inizio del test.

source: Fired before the test suite starts.
it_it: Attivato prima dell'avvio della test suite.

source: First let’s see how we can set expectations on the MakeBuzz() method, which returns a unique_ptr<Buzz>.
it_it: Per prima cosa vediamo come possiamo impostare le expectation sul metodo MakeBuzz(), che restituisce un unique_ptr<Buzz>.

source: First let’s see how we can set expectations on the `MakeBuzz()` method, which returns a `unique_ptr<Buzz>`.
it_it: Per prima cosa vediamo come possiamo impostare le expectation sul metodo `MakeBuzz()`, che restituisce un `unique_ptr<Buzz>`.

source: First of all, you can use nullptr with each of these macros, e.g. EXPECT_EQ(ptr, nullptr), EXPECT_NE(ptr, nullptr), ASSERT_EQ(ptr, nullptr), ASSERT_NE(ptr, nullptr).
it_it: Prima di tutto, si può usare nullptr con ciascuna di queste macro, ad es. EXPECT_EQ(ptr, nullptr), EXPECT_NE(ptr, nullptr), ASSERT_EQ(ptr, nullptr), ASSERT_NE(ptr, nullptr).

source: First of all, you can use `nullptr` with each of these macros, e.g. `EXPECT_EQ(ptr, nullptr)`, `EXPECT_NE(ptr, nullptr)`, `ASSERT_EQ(ptr, nullptr)`, `ASSERT_NE(ptr, nullptr)`.
it_it: Prima di tutto, si può usare `nullptr` con ciascuna di queste macro, ad es. `EXPECT_EQ(ptr, nullptr)`, `EXPECT_NE(ptr, nullptr)`, `ASSERT_EQ(ptr, nullptr)`, `ASSERT_NE(ptr, nullptr)`.

source: First, add a mock function Die() to your mock class and call it in the destructor, like this:
it_it: Innanzitutto, si aggiunge una funzione mock Die() alla classe mock e la si chiama nel distruttore, in questo modo:

source: First, add a mock function `Die()` to your mock class and call it in the destructor, like this:
it_it: Innanzitutto, si aggiunge una funzione mock `Die()` alla classe mock e la si chiama nel distruttore, in questo modo:

source: First, create a directory for your project:
it_it: Innanzitutto, si crea una directory per il progetto:

source: First, create a directory for your workspace:
it_it: Innanzitutto, si crea una directory per il workspace:

source: First, define a fixture class template, as we did with typed tests:
it_it: Innanzitutto, definisce una classe fixture template, come abbiamo fatto con i test tipizzati:

source: First, define a fixture class template.
it_it: Innanzitutto, si definisce una classe fixture template.

source: First, define a fixture class.
it_it: Innanzitutto, si definisce una classe fixture.

source: First, if the return type of a mock function is a built-in type or a pointer, the function has a default action (a void function will just return, a bool function will return false, and other functions will return 0).
it_it: Innanzitutto, se il tipo restituito di una funzione mock è un tipo nativo o un puntatore, la funzione ha un'azione di default (una funzione void tornerà e basta, una funzione bool restituirà false e le altre funzioni restituiranno 0).

source: First, if the return type of a mock function is a built-in type or a pointer, the function has a **default action** (a `void` function will just return, a `bool` function will return `false`, and other functions will return 0).
it_it: Innanzitutto, se il tipo restituito di una funzione mock è un tipo nativo o un puntatore, la funzione ha un'**azione di default** (una funzione `void` tornerà e basta, una funzione `bool` restituirà `false` e le altre funzioni restituiranno 0).

source: First, you can pass any callable of zero args as an action.
it_it: Innanzitutto, si può passare qualsiasi "callable" di zero arg come azione.

source: First, you subclass the ::testing::Environment class to define a test environment, which knows how to set-up and tear-down:
it_it: Per prima cosa, si crea una sottoclasse della classe ::testing::Environment per definire un ambiente di test, che sappia come impostare e dismettere:

source: First, you subclass the `::testing::Environment` class to define a test environment, which knows how to set-up and tear-down:
it_it: Per prima cosa, si crea una sottoclasse della classe `::testing::Environment` per definire un ambiente di test, che sappia come impostare e dismettere:

source: Flags
it_it: I Flag

source: Floating point comparisons
it_it: Confronti in virgola mobile

source: Floating-Point Comparison
it_it: Confronto in Virgola Mobile

source: Floating-Point Comparison {#floating-point}
it_it: Confronto in Virgola Mobile {#floating-point}

source: Floating-Point Matchers {#FpMatchers}
it_it: Matcher in Virgola Mobile {#FpMatchers}
